{
	"@metadata": {
		"authors": [
			"Abijeet Patro",
			"Ajeje Brazorf",
			"Amire80",
			"Antoine Lamielle",
			"FF-11",
			"FF11",
			"Liuxinyu970226",
			"MarcoAurelio",
			"MuratTheTurkish",
			"Poslovitch",
			"Robby",
			"Verdy p"
		]
	},
	"recordWizard": "The name of the extension",
	"recordwizard": "The name of the extension display on Special:SpecialPages",
	"recordWizard-desc": "{{desc|name=RecordWizard|url=https://www.mediawiki.org/wiki/Extension:RecorderWizard}}",
	"special-recordWizard-title": "Title of the special page Special:RecordWizard",
	"special-recordWizard-intro": "Description appearing on top of RecordWizard.",
	"mwe-recwiz-title": "Main title of the special page.",
	"mwe-recwiz-step-tutorial": "Name of a step displayed in the arrow line.",
	"mwe-recwiz-step-speaker": "Name of a step displayed in the arrow line.",
	"mwe-recwiz-step-details": "Name of a step displayed in the arrow line.\n\n{{Identical|Detail}}",
	"mwe-recwiz-step-studio": "Name of a step displayed in the arrow line.",
	"mwe-recwiz-step-publish": "Name of a step displayed in the arrow line.\n{{Identical|Publish}}",
	"mwe-recwiz-prevent-close": "Message displayed in a popup box if the user clicks on the cancel button.",
	"mwe-recwiz-cancel": "Label on a button, used to cancel everything and leave the RecordWizard.\n{{Identical|Cancel}}.",
	"mwe-recwiz-next": "Label on a button, used to go to the next step.",
	"mwe-recwiz-previous": "Label on a button, used to go to the previous step.",
	"mwe-recwiz-continue": "Label on a button, used to go to the next step.",
	"mwe-recwiz-continueanyway": "Label on a button, used to go to the next step when errors occurred during the current step.",
	"mwe-recwiz-retry": "Label on a button, used to retry failed uploads.",
	"mwe-recwiz-publish": "Label on a button, used to confirm the last step and upload all files on Wikimedia Commons.",
	"mwe-recwiz-restart": "Label on a button, displayed once the uploads are successful. Used to restart the RecordWizard to record some more words.",
	"mwe-recwiz-tutorial-reopenpopup": "Buton in the tutorial step to force the browser's popup asking for microphone sharing to reopen.",
	"mwe-recwiz-tutorial-activate": "Message displayed at the very beginning of the tutorial step, asking the user to allow the tool to access their microphone.",
	"mwe-recwiz-tutorial-title": "Title of the tutorial step.",
	"mwe-recwiz-tutorial-help": "The main part of the help message next to the microphone tester in the tutorial step.\nThe \"Start the test\" text should be identical to {{msg-mw|Mwe-recwiz-tutorial-mictester-start}}.",
	"mwe-recwiz-tutorial-info": "Message at the bottom of the configuration page in the tutorial step.",
	"mwe-recwiz-tutorial-mictester-info": "Short message displayed above the microphone tester in the tutorial step.",
	"mwe-recwiz-tutorial-mictester-start": "Label of a buton used to start the microphone tester in the tutorial step.",
	"mwe-recwiz-tutorial-mictester-recording": "Message indicating a state of the microphone tester in the tutorial step.",
	"mwe-recwiz-tutorial-mictester-playing": "Message indicating a state of the microphone tester in the tutorial step.",
	"mwe-recwiz-tutorial-mictester-waiting": "Message indicating a state of the microphone tester in the tutorial step.",
	"mwe-recwiz-speaker-title": "Title of the speaker step.",
	"mwe-recwiz-speaker-warning": "Message at the top of the speaker step warning the user that everything typed will be publicly visible.",
	"mwe-recwiz-speaker-profile": "Label for the profile selector field on the speaker tab.",
	"mwe-recwiz-speaker-profilemain": "Label of the option group containing the main profile in the profile selector dropdown.",
	"mwe-recwiz-speaker-profileother": "Label of the option group containing the secondary profiles in the profile selector dropdown.",
	"mwe-recwiz-speaker-profilenew": "Label of an option in the profile selector dropdown, to allow the user to create a new profile.",
	"mwe-recwiz-speaker-name": "Label of a field asking for the speaker's name on the speaker tab.",
	"mwe-recwiz-speaker-languages": "Label of a field asking for the languages the speaker knows, on the speaker tab.",
	"mwe-recwiz-speaker-languagelevel": "Label of a field asking for the speaker's level in a language, inside the language dialog box.",
	"mwe-recwiz-speaker-languagelevel-native": "Label of the option 'native' language level, displayed in the language dialog box.",
	"mwe-recwiz-speaker-languagelevel-good": "Label of the option 'good' language level, displayed in the language dialog box.\n{{Identical|Good}}",
	"mwe-recwiz-speaker-languagelevel-average": "Label of the option 'average' language level, displayed in the language dialog box.",
	"mwe-recwiz-speaker-languagelevel-beginner": "Label of the option 'beginner' language level, displayed in the language dialog box.",
	"mwe-recwiz-speaker-languagelocation": "Label of a field asking the place where the speaker has learned a language, inside the language dialog box.",
	"mwe-recwiz-speaker-location": "Label of a field asking for the place where the speaker lives, on the speaker tab.",
	"mwe-recwiz-speaker-license": "Label of a field asking the speaker to choose a license, on the speaker tab.\n{{Identical|License}}",
	"mwe-recwiz-speaker-licensecontent": "Generic license agreement which is folowed by a license selector, on the speaker tab.",
	"mwe-recwiz-speaker-agreement": "Additional agreement under the license selector, on the speaker tab.",
	"mwe-recwiz-speaker-gender": "Label of a field asking the gender of the speaker, on the speaker tab.",
	"mwe-recwiz-gender-male": "Label of the 'male' option in the gender selector.\n{{Identical|Male}}",
	"mwe-recwiz-gender-female": "Label of the 'female' option in the gender selector.",
	"mwe-recwiz-gender-other": "Label of the 'other' option in the gender selector.",
	"mwe-recwiz-details-title": "Title of the details step",
	"mwe-recwiz-details-placeholder": "Placeholder of the field to add a word in the list in the details tab.",
	"mwe-recwiz-details-help": "Help message located under the main field of the details tab. The example should not be literaly translated but adapted with two homographs which are not homophone in the target language.",
	"mwe-recwiz-details-lang": "Label of a field asking the language of the recording session, on the details tab.",
	"mwe-recwiz-details-wordlist": "Label of the textarea containing all the words to record, on the details tab.",
	"mwe-recwiz-details-randomise": "Label of a checkbox switching on the word order randomisation, on the details tab.",
	"mwe-recwiz-details-addwords": "Placeholder of the text field used to add words to the record list, on the details tab.",
	"mwe-recwiz-details-clear": "Label of the button to clear the words in the record list.",
	"mwe-recwiz-details-deduplicate": "Label of the button to deduplicate the words in the record list.",
	"mwe-recwiz-details-inspiration": "Subtitle above the button group used to start word generators.",
	"mwe-recwiz-details-generators": "Label above a button group used to start word generators.",
	"mwe-recwiz-details-noword": "Status message indicating there are no words in the record list.",
	"mwe-recwiz-details-wordcount": "Status message indicationg the number of words in the list.",
	"mwe-recwiz-generator-nearby": "Label of the button to open the 'neaby' generator dialog box, on the details tab.",
	"mwe-recwiz-generator-list": "Label of the button to open the 'list' generator dialog box, on the details tab.",
	"mwe-recwiz-generator-wmcategory": "Label of the button to open the 'Wikimedia Category' generator dialog box, on the details tab.",
	"mwe-recwiz-studio-title": "Title of the studio step.",
	"mwe-recwiz-studio-info-audio": "Informational message at the top of the studio step.",
	"mwe-recwiz-studio-info-video": "Informational message at the top of the studio step.",
	"mwe-recwiz-studio-skip": "Label of a button allowing the user to skip the current word, on the studio step.",
	"mwe-recwiz-studio-input-placeholder": "Placeholder of the text field used to add words to the record list, on the studio tab.",
	"mwe-recwiz-studio-uploadcount": "Status message indicationg the total number of uploads and the number of upload succeded.",
	"mwe-recwiz-videostudio-webcamaccess": "Ask the user to allow it's navigator to use it's webcam in the video studio.",
	"mwe-recwiz-videostudio-ready": "Message displayed when the video studio is ready to be used.",
	"mwe-recwiz-videostudio-clicktostart": "Message encouraging the user to start the video recorder.",
	"mwe-recwiz-videostudio-stopped": "Message displayed in the video studio when the video recorder has been stopped or canceled.",
	"mwe-recwiz-videostudio-endofthelist": "Message displayed in the video studio when the user has reached the end of the list of words to record.",
	"mwe-recwiz-videostudio-currentlyrecording": "Message displayed in the video studio when the video recorder is running, just above the word being recorded.",
	"mwe-recwiz-videostudio-willstart": "Message displayed between two recordings in the video studio. $1 represents the next word to record.",
	"mwe-recwiz-publish-title": "Title of the publish step.",
	"mwe-recwiz-publish-play": "Label of a tooltip over a button, which is used to start the listening of a record.\n{{Identical|Play}}",
	"mwe-recwiz-publish-remove": "Label of a tooltip over a button, which is used to remove a record.\n{{Identical|Remove}}",
	"mwe-recwiz-publish-areyousure": "Text inside a popup, which ask the user for a confirmation before removing a record.",
	"mwe-recwiz-publish-removelabel": "Label of the button used to confirm the deletion of a record.\n{{Identical|Remove}}",
	"mwe-recwiz-publish-commonsfilelist": "Label of the button at the bottom of the publish step used to go to Commons",
	"mwe-recwiz-publish-nomedia": "Label displayed when the user has not selected any media file to preview in the publish step.",
	"mwe-recwiz-pendinguplads": "Status message next to the continue button indicating that some uploads are still pending.",
	"mwe-recwiz-allsucceeded": "Status message next to the continue button indicating that all uploads are successful.",
	"mwe-recwiz-somefailed": "Status message next to the continue button indicating that some uploads have failed.",
	"mwe-recwiz-allfailed": "Status message next to the continue button indicating that all uploads have failed.",
	"mwe-recwiz-settings-videorecording": "Label displayed in the user settings menu.",
	"mwe-recwiz-settings-durationtorecord": "Label displayed in the user settings menu.",
	"mwe-recwiz-settings-delaybetweenrecords": "Label displayed in the user settings menu.",
	"mwe-recwiz-settings-audiorecording": "Label displayed in the user settings menu.",
	"mwe-recwiz-settings-startthreshold": "Label displayed in the user settings menu.",
	"mwe-recwiz-settings-stopthreshold": "Label displayed in the user settings menu.",
	"mwe-recwiz-settings-saturationthreshold": "Label displayed in the user settings menu.",
	"mwe-recwiz-settings-stopduration": "Label displayed in the user settings menu.",
	"mwe-recwiz-settings-marginbefore": "Label displayed in the user settings menu.",
	"mwe-recwiz-settings-marginafter": "Label displayed in the user settings menu.",
	"mwe-recwiz-settings-sec": "Unit displayed at the end of some fields, abbreviation of 'a second' (time unit).",
	"mwe-recwiz-shortcuts-title": "Text inside a popup, which explains to the user the keyboard shortcuts that are available to them",
	"mwe-recwiz-shortcuts-previous-word": "Text explaining that this shortcut lets the user go backward through the list of words to record.",
	"mwe-recwiz-shortcuts-next-word": "Text explaining that this shortcut lets the user go forward through the list of words to record.",
	"mwe-recwiz-shortcuts-delete-recording": "Text explaining that this shortcut deletes the currently selected (highlighted) recording.",
	"mwe-recwiz-shortcuts-listen-recording": "Text explaining that this shortcut lets the user listen to the currently selected (highlighted) recording.",
	"mwe-recwiz-shortcuts-toggle-recording": "Text explaining that this shortcut toggles (either enable or disable) the recorder.",
	"mwe-recwiz-error-mediastream-notallowed": "Error message occuring when the user disalow to share access to its microphone.",
	"mwe-recwiz-error-mediastream-notfound": "Error message occuring when no microphone has been found.",
	"mwe-recwiz-error-mediastream-technical": "Error message occuring when access to the microphone is blocked by a technical problem on the user's side.",
	"mwe-recwiz-error-mediastream-unknow": "Error message occuring when an unknown error block the script to use the microphone.",
	"mwe-recwiz-error-noname": "Error message indicating that the name field can not be empty.",
	"mwe-recwiz-error-duplicatename": "Error message indicating that the value of the name field is already used by an other speaker.",
	"mwe-recwiz-error-nolanguages": "Error message indicating that the language field can not be empty.",
	"mwe-recwiz-error-emptylist": "Error message indicating that the record word list can not be empty.",
	"mwe-recwiz-error-network": "Error message displayed in an alert box, indicating that the server can't be reached due to a network error.",
	"mwe-recwiz-warning-wordsleft": "Warning message displayed when the user continue to next step when some words are left.",
	"mwe-recwiz-warning-pendinguploads": "Warning message displayed when the user continue while uploads are still pending.",
	"mwe-recwiz-warning-faileduploads": "Warning message displayed when the user continue while some uploads have failed.",
	"mwe-recwiz-nearby-coordinates": "Label of the coordinates field, in the nearby generator dialog box.",
	"mwe-recwiz-nearby-coordinates-help": "Help message displayed in a popup nextto the coordinates field, in the nearby generator dialog box.",
	"mwe-recwiz-nearby-limit": "Label of the limit field, in the nearby generator dialog box.\n\nSee also {{msg-mw|mwe-recwiz-wmcategory-limit}}",
	"mwe-recwiz-nearby-limit-help": "Help message displayed in a popup nextto the limit field, in the nearby generator dialog box.",
	"mwe-recwiz-nearby-latitude": "Placeholder of the latitude field, in the nearby generator dialog box.\n{{Identical|Latitude}}",
	"mwe-recwiz-nearby-longitude": "Placeholder of the longitude field, in the nearby generator dialog box.\n{{Identical|Longitude}}",
	"mwe-recwiz-nearby-getcoordinates": "Title attribute of the automatic coordinates fetching button, in the nearby generator dialog box.",
	"mwe-recwiz-nearby-source": "Label of the data source selector, in the nearby generator dialog box.",
	"mwe-recwiz-nearby-deduplicate": "Label of the switch controlling the exclusion of words already recorded, in the nearby generator dialog box.\n\nSee also {{msg-mw|Mwe-recwiz-wmcategory-deduplicate}}",
	"mwe-recwiz-error-cantgetposition": "Error message indicating that the automatic coordinates fetching has failed.",
	"mwe-recwiz-warning-noresults": "Warning message indicating that the request gives no results.",
	"mwe-recwiz-list-title": "Label of the page title field, in the list generator dialog box.",
	"mwe-recwiz-list-title-help": "Help message displayed in a popup next to the page title field, in the list generator dialog box.",
	"mwe-recwiz-list-deduplicate": "Label of the switch controling the exclusion of words already recorded, in the list generator dialog box.",
	"mwe-recwiz-wmcategory-title": "Label of the page title field, in the 'Wikimedia Category' generator dialog box.",
	"mwe-recwiz-wmcategory-title-help": "Help message displayed in a popup nextto the page title field, in the 'Wikimedia Category' generator dialog box.",
	"mwe-recwiz-wmcategory-source": "Label of the data source selector, in the Wikimedia Category generator dialog box.\n{{Identical|mwe-recwiz-nearby-source}}",
	"mwe-recwiz-wmcategory-wikipedia": "Label of a radio button in the 'Wikimedia Category' generator dialog box.",
	"mwe-recwiz-wmcategory-wiktionary": "Label of a radio button in the 'Wikimedia Category' generator dialog box.",
	"mwe-recwiz-wmcategory-deduplicate": "Label of the switch controling the exclusion of words already recorded, in the 'Wikimedia Category' generator dialog box.\n\nSee also {{msg-mw|Mwe-recwiz-nearby-deduplicate}}",
	"mwe-recwiz-wmcategory-limit": "Label of the limit field, in the 'Wikimedia Category' generator dialog box.\n\nSee also {{msg-mw|Mwe-recwiz-nearby-limit}}",
	"mwe-recwiz-wmcategory-limit-help": "Help message displayed in a popup nextto the limit field, in the 'Wikimedia Category' generator dialog box.",
	"mwe-recwiz-list-error-nopage": "Error message indicating that no page was entered.",
	"mwe-recwiz-error-pagemissing": "Error message indicating that the given page cannot be found.",
	"mwe-recwiz-error-nowiki": "Error message indicating that the generator cannot find a Wikipedia or a Wiktionary in the selected language."
}
